       IDENTIFICATION DIVISION.
       PROGRAM-ID. bonjour.
       AUTHOR. lucas.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
      
      * on affiche 5 fois bonjour    
           PERFORM 5 times
           DISPLAY "Bonjour"
           END-PERFORM.

           STOP RUN.
